# Напишите программу для. проверки
# истинности утверждения
# (W ⋀ Z) ⋁ ¬Y ⋁ (¬X ≡ ¬W) для всех значений предикат.

for x in range (2):
    for y in range (2):
        for z in range (2):
            for w in range (2):
                if  (w <= z) or not (y)  or not (x == w ):
                    print(w,x,y,z)