#  Напишите программу, которая принимает на вход число N и 
#  выдаёт последовательность из N членов.


for i in range(int(input("Введите число "))):
    print((-3)**i, end = '  ')
